import math

x = float(input("введите координату x: "))
y = float(input("введите координату y: "))

a = ((x + 4) ** 2 + (y + 4) ** 2) <= 16  # круг
b = (-4 <= x <= 5) and (-3 <= y <= 0)  # прямоугольник ниже нуля
c = (-6 <= x <= -2) and (-6 <= y <= -3)  # прямоугольник внутри круга
d = (-2 <= x <= 2) and (0 <= y <= 4)  # прямоугольник выше нуля
bcd = b or c or d  # объединяем в одну фигуру

if (a and (not bcd)) or (bcd and (not a)):  # условие геометрической разности
    print("true")
else:
    print("false")
